<?xml version="1.0" ?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="452" name="input" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32"/>
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="2051205512625" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="2052205612301" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="2053205712904" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="2054205811809" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="1851185513105" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="1852185613366" type="Const" version="opset1">
			<data offset="12" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="1853185711566" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="1854185812907" type="Const" version="opset1">
			<data offset="12" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="2971297511515" type="Const" version="opset1">
			<data offset="16" size="4096" shape="1024,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="2972297611950" type="Const" version="opset1">
			<data offset="4112" size="4096" shape="1024,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="2973297712628" type="Const" version="opset1">
			<data offset="16" size="4096" shape="1024,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="2974297813210" type="Const" version="opset1">
			<data offset="4112" size="4096" shape="1024,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="classifier.0.weight104312838" type="Const" version="opset1">
			<data offset="8208" size="1179648" shape="1024,576" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="classifier.0.weight10438214/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="classifier.0.weight">
					<dim>1024</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/classifier/classifier.0/Gemm/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>576</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1024</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_1646104011632" type="Const" version="opset1">
			<data offset="1187856" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="4540454412193" type="Const" version="opset1">
			<data offset="1187872" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="4541454511251" type="Const" version="opset1">
			<data offset="1187876" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="4542454611512" type="Const" version="opset1">
			<data offset="1187872" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="4543454712091" type="Const" version="opset1">
			<data offset="1187876" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="Range_1642103811308" type="Const" version="opset1">
			<data offset="1187880" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="2991299513762" type="Const" version="opset1">
			<data offset="1187896" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="2992299612880" type="Const" version="opset1">
			<data offset="1187900" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="2993299712526" type="Const" version="opset1">
			<data offset="1187896" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2994299813132" type="Const" version="opset1">
			<data offset="1187900" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="2651265513663" type="Const" version="opset1">
			<data offset="1187904" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2652265611218" type="Const" version="opset1">
			<data offset="1187908" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="2653265711524" type="Const" version="opset1">
			<data offset="1187904" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="2654265811587" type="Const" version="opset1">
			<data offset="1187908" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="1891189511575" type="Const" version="opset1">
			<data offset="1187912" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="1892189611911" type="Const" version="opset1">
			<data offset="1187916" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="1893189711917" type="Const" version="opset1">
			<data offset="1187912" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="1894189812208" type="Const" version="opset1">
			<data offset="1187916" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="2151215513039" type="Const" version="opset1">
			<data offset="1187920" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="2152215612787" type="Const" version="opset1">
			<data offset="1187924" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="2153215712508" type="Const" version="opset1">
			<data offset="1187920" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="2154215813249" type="Const" version="opset1">
			<data offset="1187924" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="2721272513501" type="Const" version="opset1">
			<data offset="1187928" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="2722272611317" type="Const" version="opset1">
			<data offset="1187932" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="2723272712634" type="Const" version="opset1">
			<data offset="1187928" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="2724272811782" type="Const" version="opset1">
			<data offset="1187932" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="2781278512607" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="2782278611434" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="2783278711206" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="2784278812910" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="3441344513723" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="3442344611629" type="Const" version="opset1">
			<data offset="1187944" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="3443344711743" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="3444344813243" type="Const" version="opset1">
			<data offset="1187944" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="2071207512940" type="Const" version="opset1">
			<data offset="1187948" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="2072207612952" type="Const" version="opset1">
			<data offset="1187952" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="2073207711269" type="Const" version="opset1">
			<data offset="1187948" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="2074207812283" type="Const" version="opset1">
			<data offset="1187952" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="Range_156299811470" type="Const" version="opset1">
			<data offset="1187880" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="2671267511431" type="Const" version="opset1">
			<data offset="1187956" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="2672267612832" type="Const" version="opset1">
			<data offset="1187960" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="2673267711986" type="Const" version="opset1">
			<data offset="1187956" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="2674267811599" type="Const" version="opset1">
			<data offset="1187960" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="3021302512679" type="Const" version="opset1">
			<data offset="1187964" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="3022302612154" type="Const" version="opset1">
			<data offset="1187968" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="3023302711635" type="Const" version="opset1">
			<data offset="1187964" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="3024302812238" type="Const" version="opset1">
			<data offset="1187968" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="3281328511653" type="Const" version="opset1">
			<data offset="1187972" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="3282328613270" type="Const" version="opset1">
			<data offset="1190276" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="3283328712919" type="Const" version="opset1">
			<data offset="1187972" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="3284328811965" type="Const" version="opset1">
			<data offset="1190276" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="2861286511914" type="Const" version="opset1">
			<data offset="1192580" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="2862286612175" type="Const" version="opset1">
			<data offset="1192584" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="2863286712037" type="Const" version="opset1">
			<data offset="1192580" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="2864286812418" type="Const" version="opset1">
			<data offset="1192584" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="3171317511740" type="Const" version="opset1">
			<data offset="1192588" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="3172317612580" type="Const" version="opset1">
			<data offset="1194892" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="3173317712070" type="Const" version="opset1">
			<data offset="1192588" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="3174317812601" type="Const" version="opset1">
			<data offset="1194892" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Conv_51197511278" type="Const" version="opset1">
			<data offset="1197196" size="110592" shape="576,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="onnx::Conv_5119758191/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_511">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/features/features.11/block/block.0/block.0.0/Conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="2161216511440" type="Const" version="opset1">
			<data offset="1307788" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="2162216613405" type="Const" version="opset1">
			<data offset="1307792" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="2163216713561" type="Const" version="opset1">
			<data offset="1307788" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="2164216813588" type="Const" version="opset1">
			<data offset="1307792" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="3221322513330" type="Const" version="opset1">
			<data offset="1307796" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="3222322611746" type="Const" version="opset1">
			<data offset="1307800" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="3223322711326" type="Const" version="opset1">
			<data offset="1307796" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="3224322813747" type="Const" version="opset1">
			<data offset="1307800" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="2011201512169" type="Const" version="opset1">
			<data offset="1307804" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="2012201611437" type="Const" version="opset1">
			<data offset="1307808" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="2013201712259" type="Const" version="opset1">
			<data offset="1307804" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="2014201811407" type="Const" version="opset1">
			<data offset="1307808" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="3101310513444" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="3102310611275" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="3103310712898" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="3104310813756" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="3121312513576" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="3122312611710" type="Const" version="opset1">
			<data offset="1307812" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="3123312713606" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="3124312811194" type="Const" version="opset1">
			<data offset="1307812" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="2941294513348" type="Const" version="opset1">
			<data offset="1307816" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="2942294612676" type="Const" version="opset1">
			<data offset="1307820" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="2943294712337" type="Const" version="opset1">
			<data offset="1307816" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="2944294811167" type="Const" version="opset1">
			<data offset="1307820" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="Range_141594613078" type="Const" version="opset1">
			<data offset="1187880" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1841184513264" type="Const" version="opset1">
			<data offset="1307824" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="1842184613519" type="Const" version="opset1">
			<data offset="1307828" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="1843184712409" type="Const" version="opset1">
			<data offset="1307824" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="1844184813162" type="Const" version="opset1">
			<data offset="1307828" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="3461346511185" type="Const" version="opset1">
			<data offset="1307832" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="3462346612310" type="Const" version="opset1">
			<data offset="1307836" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="3463346713450" type="Const" version="opset1">
			<data offset="1307832" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="3464346811545" type="Const" version="opset1">
			<data offset="1307836" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="2921292511461" type="Const" version="opset1">
			<data offset="1307840" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="2922292612211" type="Const" version="opset1">
			<data offset="1310144" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="2923292713582" type="Const" version="opset1">
			<data offset="1307840" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="2924292813699" type="Const" version="opset1">
			<data offset="1310144" size="2304" shape="1,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="2551255513300" type="Const" version="opset1">
			<data offset="1312448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="2552255613273" type="Const" version="opset1">
			<data offset="1312452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="2553255711368" type="Const" version="opset1">
			<data offset="1312448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="2554255812901" type="Const" version="opset1">
			<data offset="1312452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="3511351512040" type="Const" version="opset1">
			<data offset="1312456" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="3512351612514" type="Const" version="opset1">
			<data offset="1314760" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="3513351711869" type="Const" version="opset1">
			<data offset="1312456" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="3514351813099" type="Const" version="opset1">
			<data offset="1314760" size="2304" shape="576,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="onnx::Conv_50292313216" type="Const" version="opset1">
			<data offset="1317064" size="110592" shape="576,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="onnx::Conv_5029238174/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_502">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/features/features.10/block/block.0/block.0.0/Conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="3231323513423" type="Const" version="opset1">
			<data offset="1427656" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="3232323611245" type="Const" version="opset1">
			<data offset="1427660" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="3233323712400" type="Const" version="opset1">
			<data offset="1427656" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="3234323811674" type="Const" version="opset1">
			<data offset="1427660" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="3561356511602" type="Const" version="opset1">
			<data offset="1427664" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="3562356612115" type="Const" version="opset1">
			<data offset="1427668" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="3563356712370" type="Const" version="opset1">
			<data offset="1427664" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="3564356811833" type="Const" version="opset1">
			<data offset="1427668" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="3001300512538" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="3002300613417" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="3003300711830" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="136" name="3004300813069" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="3401340511662" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="3402340611650" type="Const" version="opset1">
			<data offset="1427672" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="3403340713750" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="140" name="3404340813033" type="Const" version="opset1">
			<data offset="1427672" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="141" name="2471247512577" type="Const" version="opset1">
			<data offset="1427676" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="2472247612964" type="Const" version="opset1">
			<data offset="1427680" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="2473247713585" type="Const" version="opset1">
			<data offset="1427676" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="2474247813285" type="Const" version="opset1">
			<data offset="1427680" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="Range_126989511305" type="Const" version="opset1">
			<data offset="1187880" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="2211221511557" type="Const" version="opset1">
			<data offset="1427684" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="147" name="2212221613612" type="Const" version="opset1">
			<data offset="1427688" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="148" name="2213221713240" type="Const" version="opset1">
			<data offset="1427684" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="149" name="2214221812127" type="Const" version="opset1">
			<data offset="1427688" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="150" name="2341234512274" type="Const" version="opset1">
			<data offset="1427692" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="151" name="2342234613702" type="Const" version="opset1">
			<data offset="1427696" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="152" name="2343234711797" type="Const" version="opset1">
			<data offset="1427692" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="153" name="2344234811938" type="Const" version="opset1">
			<data offset="1427696" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="154" name="2901290513042" type="Const" version="opset1">
			<data offset="1427700" size="1152" shape="1,288,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="2902290613543" type="Const" version="opset1">
			<data offset="1428852" size="1152" shape="1,288,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="2903290712019" type="Const" version="opset1">
			<data offset="1427700" size="1152" shape="1,288,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="2904290812448" type="Const" version="opset1">
			<data offset="1428852" size="1152" shape="1,288,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="2741274512541" type="Const" version="opset1">
			<data offset="1430004" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="2742274612892" type="Const" version="opset1">
			<data offset="1430008" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="160" name="2743274711215" type="Const" version="opset1">
			<data offset="1430004" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="161" name="2744274812844" type="Const" version="opset1">
			<data offset="1430008" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="162" name="2841284512199" type="Const" version="opset1">
			<data offset="1430012" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="163" name="2842284613471" type="Const" version="opset1">
			<data offset="1430016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="164" name="2843284712583" type="Const" version="opset1">
			<data offset="1430012" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="165" name="2844284813189" type="Const" version="opset1">
			<data offset="1430016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="166" name="3481348513228" type="Const" version="opset1">
			<data offset="1430020" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="167" name="3482348611884" type="Const" version="opset1">
			<data offset="1430024" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="168" name="3483348712277" type="Const" version="opset1">
			<data offset="1430020" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="169" name="3484348812640" type="Const" version="opset1">
			<data offset="1430024" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="170" name="2241224513102" type="Const" version="opset1">
			<data offset="1430028" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="171" name="2242224613462" type="Const" version="opset1">
			<data offset="1430032" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="172" name="2243224711254" type="Const" version="opset1">
			<data offset="1430028" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="173" name="2244224811752" type="Const" version="opset1">
			<data offset="1430032" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="174" name="2581258512556" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="175" name="2582258613057" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="176" name="2583258711164" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="177" name="2584258812484" type="Const" version="opset1">
			<data offset="1187940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="178" name="1801180511302" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="179" name="1802180613342" type="Const" version="opset1">
			<data offset="1430036" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="180" name="1803180713759" type="Const" version="opset1">
			<data offset="1187936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="181" name="1804180812889" type="Const" version="opset1">
			<data offset="1430036" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="182" name="2281228512367" type="Const" version="opset1">
			<data offset="1430040" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="183" name="2282228611458" type="Const" version="opset1">
			<data offset="1430044" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="184" name="2283228713447" type="Const" version="opset1">
			<data offset="1430040" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="185" name="2284228811800" type="Const" version="opset1">
			<data offset="1430044" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="186" name="Range_112284311503" type="Const" version="opset1">
			<data offset="1187880" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="187" name="2361236511716" type="Const" version="opset1">
			<data offset="1430048" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="188" name="2362236612265" type="Const" version="opset1">
			<data offset="1430052" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="189" name="2363236713063" type="Const" version="opset1">
			<data offset="1430048" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="190" name="2364236812490" type="Const" version="opset1">
			<data offset="1430052" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="191" name="1821182513351" type="Const" version="opset1">
			<data offset="1430056" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="192" name="1822182612379" type="Const" version="opset1">
			<data offset="1430060" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="193" name="1823182713549" type="Const" version="opset1">
			<data offset="1430056" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="194" name="1824182812670" type="Const" version="opset1">
			<data offset="1430060" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="195" name="2221222513126" type="Const" version="opset1">
			<data offset="1430064" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="196" name="2222222611926" type="Const" version="opset1">
			<data offset="1430640" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="197" name="2223222712139" type="Const" version="opset1">
			<data offset="1430064" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="198" name="2224222812694" type="Const" version="opset1">
			<data offset="1430640" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="199" name="2431243513327" type="Const" version="opset1">
			<data offset="1431216" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="200" name="2432243611974" type="Const" version="opset1">
			<data offset="1431220" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="201" name="2433243713213" type="Const" version="opset1">
			<data offset="1431216" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="202" name="2434243813399" type="Const" version="opset1">
			<data offset="1431220" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="203" name="1981198513294" type="Const" version="opset1">
			<data offset="1431224" size="576" shape="144,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="204" name="1982198612268" type="Const" version="opset1">
			<data offset="1431800" size="576" shape="144,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="205" name="1983198713603" type="Const" version="opset1">
			<data offset="1431224" size="576" shape="144,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="206" name="1984198813684" type="Const" version="opset1">
			<data offset="1431800" size="576" shape="144,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="207" name="onnx::Conv_48482013321" type="Const" version="opset1">
			<data offset="1432376" size="13824" shape="144,48,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="208" name="onnx::Conv_4848208140/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
